# HasInvalidKey Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClassificationEntry..::..HasInvalidKey Method
ClassificationEntry Class See Also
---
Checks if the key matches the level and parent key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasInvalidKey()
```

Visual Basic
---
```text
Public Function HasInvalidKey As Boolean
```

Visual C++
---
```text
public:
bool HasInvalidKey()
```

# ### Return Value
True if the key doesn't matach the level and parent key. False otherwise.
# See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace